bolknote/MK61S_MINI/code/tools.cpp
  bool  inc_operand = false;
  u8    move_code, copy_code = opcode;

  const usize program_steps = core_61::program_steps();
  for(usize i = into_step; i < program_steps; i++) {
    move_code = code_page[i];

    if(inc_operand) {
      // необходима коррекция операнда предыдущей команды
      if(copy_code >= into_step) copy_code++;
      inc_operand = false;
    } else { // рассматриваемое данное это команда, не операнд!
      if(core_61::len_code_command(copy_code) == 2) { 
      // установить необходимость коррекция второго операнда команды (адреса перехода)
        dbgln(MINI, "Step ", i, " 2 operand opcode: ", copy_code);
        inc_operand = true;
      }
    }
    code_page[i] = copy_code;
    copy_code = move_code;
  }
  core_61::set_code_page(code_page);
}

SpiNorFlash flash(PIN_SPIFLASH_CS);
bool      flash_is_ok;

static constexpr u32 LEGACY_EEPROM_PAGE_SIZE = 8 * 1024;

static u32 settings_flash_address(void) {
  return program_store::settings_address();
}

static u16 settings_flash_size(void) {
  return program_store::settings_size();
}

struct PersistentSettings {
  u8 grade;
  u8 counter;
  u8 flags;
  u8 sound;
  lcd_display::TextProfile text_profile;
  bool text_profile_stored;
};

static PersistentSettings persistent_settings = {
  0xFF,
  0,
  0xFF,
  0xFF,
  lcd_display::defaultTextProfileForRows(lcd_display::DEFAULT_ROWS),
  false
};
static bool persistent_settings_loaded = false;
static bool persistent_settings_sector_dirty = false;
static bool persistent_settings_needs_save = false;
static bool persistent_settings_write_blocked = false;
static u32 persistent_settings_next_address;

static void reset_persistent_settings_cache(void) {
  persistent_settings.grade = 0xFF;
  persistent_settings.counter = 0;
  persistent_settings.flags = 0xFF;
  persistent_settings.sound = 0xFF;
  persistent_settings.text_profile = lcd_display::defaultTextProfileForRows(lcd_display::DEFAULT_ROWS);
  persistent_settings.text_profile_stored = false;
  persistent_settings_loaded = true;
  persistent_settings_sector_dirty = false;
  persistent_settings_needs_save = true;
  persistent_settings_write_blocked = false;
  persistent_settings_next_address = settings_flash_address();
}

static void apply_settings_record(const settings_journal::RecordData& record) {
  persistent_settings.grade = record.grade;
  persistent_settings.counter = record.counter;
  persistent_settings.flags = record.flags;
  persistent_settings.sound = record.sound;
  persistent_settings.text_profile_stored = false;
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  if(record.text_profile_stored) {
    persistent_settings.text_profile = lcd_display::normalizeTextProfile({
      record.text_rows,
      record.text_width,
      record.text_height,
      record.text_gap
    });
    persistent_settings.text_profile_stored = true;
  } else {
    persistent_settings.text_profile = lcd_display::defaultTextProfileForRows(lcd_display::DEFAULT_ROWS);
  }
#else
  persistent_settings.text_profile = lcd_display::defaultTextProfileForRows(lcd_display::DEFAULT_ROWS);
#endif
}

static u16 internal_flash_size_kb(void) {
#if defined(FLASHSIZE_BASE)
  return *((const volatile u16*) FLASHSIZE_BASE);
#else
  return 0;
#endif
}

static u8 read_legacy_eeprom_byte(usize offset) {
#if defined(FLASH_BASE)
  const u16 flash_size_kb = internal_flash_size_kb();
  if(flash_size_kb == 0 || flash_size_kb == 0xFFFF) return 0xFF;
  const u32 base = FLASH_BASE + ((u32) flash_size_kb * 1024UL) - LEGACY_EEPROM_PAGE_SIZE;
  return *((const volatile u8*) (base + offset));
#else
  (void) offset;
  return 0xFF;
#endif
}

static u8 read_legacy_eeprom_with_legacy(usize current_addr, usize legacy_addr) {
  const u8 current_value = read_legacy_eeprom_byte(current_addr);
  if(current_value != 0xFF) return current_value;
  return read_legacy_eeprom_byte(legacy_addr);
}

static void import_legacy_settings(void) {
  const u8 grade = read_legacy_eeprom_with_legacy(switch_R_GRD_G, legacy_switch_R_GRD_G);
  const u8 counter = read_legacy_eeprom_with_legacy(count_switch_R_GRD_G, legacy_count_switch_R_GRD_G);
  const u8 flags = read_legacy_eeprom_byte(switch_settings);
  const u8 sound = read_legacy_eeprom_byte(switch_sound_settings);

  persistent_settings.grade = grade;
  persistent_settings.counter = (counter == 0xFF) ? 0 : counter;
  persistent_settings.flags = flags;
  persistent_settings.sound = sound;
  persistent_settings.text_profile = lcd_display::defaultTextProfileForRows(lcd_display::DEFAULT_ROWS);
  persistent_settings.text_profile_stored = false;
  persistent_settings_needs_save = true;
}

static void load_persistent_settings(void) {
  if(persistent_settings_loaded) return;
  persistent_settings_loaded = true;
  const u32 settings_address = settings_flash_address();
  const u16 settings_size = settings_flash_size();
  persistent_settings_next_address = settings_address;
  persistent_settings_sector_dirty = false;
  persistent_settings_needs_save = false;
  persistent_settings_write_blocked = false;

  if(!flash_is_ok || !program_store::ready() || settings_size == 0) {
    import_legacy_settings();
    return;
  }

  settings_journal::Scanner scanner(settings_size);
  while(scanner.active()) {
    u8 record[settings_journal::RECORD_SIZE];
    const u32 address = settings_address + (u32) scanner.next_offset();
    if(!flash.readByteArray(address, record, sizeof(record))) {
      // A transient read error must never trigger an erase of potentially
      // valid settings. Keep using defaults and block writes for this boot.
      persistent_settings_write_blocked = true;
      persistent_settings_needs_save = true;
      return;
    }
    scanner.consume(record);
  }

  if(scanner.has_value()) {
    apply_settings_record(scanner.latest());
    persistent_settings_needs_save = scanner.migration_needed();
  } else if(scanner.ended_at_erased()) {
    import_legacy_settings();
  } else {
    persistent_settings_needs_save = true;
  }

  persistent_settings_sector_dirty = scanner.needs_reclaim();
  persistent_settings_next_address = settings_address + (u32) scanner.next_offset();
  if(persistent_settings_sector_dirty) persistent_settings_needs_save = true;
}

static bool write_persistent_settings(void) {
  load_persistent_settings();
  // There is no useful retry path during this boot when flash is absent or a
  // settings read failed. Preserve the dirty RAM state for diagnostics, but
  // do not keep the UI retry timer spinning forever.
  if(!flash_is_ok || persistent_settings_write_blocked) return true;
  if(!persistent_settings_needs_save) return true;

  const u32 settings_address = settings_flash_address();
  const u16 settings_size = settings_flash_size();
  if(settings_address == 0 || settings_size == 0) return true;
  const u32 end_address = settings_address + settings_size;
  if(persistent_settings_sector_dirty ||
     persistent_settings_next_address > end_address - settings_journal::RECORD_SIZE) {
    if(!program_store::erase_settings()) return false;
    persistent_settings_next_address = settings_address;
    persistent_settings_sector_dirty = false;
  }

  settings_journal::RecordData data = {};
  data.grade = persistent_settings.grade;
  data.counter = persistent_settings.counter;
  data.flags = persistent_settings.flags;
  data.sound = persistent_settings.sound;
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  data.text_profile_stored = persistent_settings.text_profile_stored;
  data.text_rows = persistent_settings.text_profile.rows;
  data.text_width = persistent_settings.text_profile.glyph_width;
  data.text_height = persistent_settings.text_profile.glyph_height;
  data.text_gap = persistent_settings.text_profile.line_gap;
#endif

  u8 record[settings_journal::RECORD_SIZE];
  settings_journal::encode_uncommitted(data, record);
  const u32 address = persistent_settings_next_address;
  if(!flash.writeByteArray(address, record, settings_journal::COMMIT_INDEX)) {
    persistent_settings_sector_dirty = true;
    persistent_settings_next_address = end_address;
    return false;
  }
  if(!flash.writeByte(address + settings_journal::COMMIT_INDEX, settings_journal::COMMIT_MARKER)) {
    persistent_settings_sector_dirty = true;
    persistent_settings_next_address = end_address;
    return false;
  }

