bolknote/MK61S_MINI/code/tools.cpp
  persistent_settings_next_address += settings_journal::RECORD_SIZE;
  persistent_settings_needs_save = false;
  return true;
}

AngleUnit read_stored_grade_switch(void) {
  load_persistent_settings();
  return (AngleUnit) persistent_settings.grade;
}

u8 read_counter_switch(void) {
  load_persistent_settings();
  return persistent_settings.counter;
}

SettingsFlags read_settings_flags(void) {
  load_persistent_settings();
  return normalize_settings_flags(persistent_settings.flags);
}

void store_settings_flags(SettingsFlags flags) {
  load_persistent_settings();
  flags = normalize_settings_flags(flags.raw);
  if(persistent_settings.flags != flags.raw) {
    persistent_settings.flags = flags.raw;
    persistent_settings_needs_save = true;
  }

  write_persistent_settings();
}

SoundSettings read_sound_settings(void) {
  load_persistent_settings();
  return normalize_sound_settings(persistent_settings.sound);
}

void store_sound_settings(SoundSettings settings) {
  load_persistent_settings();
  settings = normalize_sound_settings(settings.raw);
  if(persistent_settings.sound != settings.raw) {
    persistent_settings.sound = settings.raw;
    persistent_settings_needs_save = true;
  }

  write_persistent_settings();
}

bool read_display_text_profile(lcd_display::TextProfile& out) {
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  load_persistent_settings();
  if(!persistent_settings.text_profile_stored) return false;

  out = lcd_display::normalizeTextProfile(persistent_settings.text_profile);
  return true;
#else
  (void) out;
  load_persistent_settings();
  return false;
#endif
}

void store_display_text_profile(lcd_display::TextProfile profile) {
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  load_persistent_settings();
  profile = lcd_display::normalizeTextProfile(profile);
  const bool unchanged = persistent_settings.text_profile_stored &&
    persistent_settings.text_profile.rows == profile.rows &&
    persistent_settings.text_profile.glyph_width == profile.glyph_width &&
    persistent_settings.text_profile.glyph_height == profile.glyph_height &&
    persistent_settings.text_profile.line_gap == profile.line_gap;
  if(!unchanged) {
    persistent_settings.text_profile = profile;
    persistent_settings.text_profile_stored = true;
    persistent_settings_needs_save = true;
  }
  write_persistent_settings();
#else
  (void) profile;
#endif
}

bool store_settings_snapshot(
  SettingsFlags flags,
  SoundSettings sound,
  const lcd_display::TextProfile* text_profile
) {
  load_persistent_settings();
  flags = normalize_settings_flags(flags.raw);
  sound = normalize_sound_settings(sound.raw);

  if(persistent_settings.flags != flags.raw) {
    persistent_settings.flags = flags.raw;
    persistent_settings_needs_save = true;
  }
  if(persistent_settings.sound != sound.raw) {
    persistent_settings.sound = sound.raw;
    persistent_settings_needs_save = true;
  }

#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  if(text_profile != NULL) {
    const lcd_display::TextProfile profile = lcd_display::normalizeTextProfile(*text_profile);
    const bool unchanged = persistent_settings.text_profile_stored &&
      persistent_settings.text_profile.rows == profile.rows &&
      persistent_settings.text_profile.glyph_width == profile.glyph_width &&
      persistent_settings.text_profile.glyph_height == profile.glyph_height &&
      persistent_settings.text_profile.line_gap == profile.line_gap;
    if(!unchanged) {
      persistent_settings.text_profile = profile;
      persistent_settings.text_profile_stored = true;
      persistent_settings_needs_save = true;
    }
  }
#else
  (void) text_profile;
#endif

  return write_persistent_settings();
}

void store_grade_switch(AngleUnit angle_unit) {
  load_persistent_settings();
  if(angle_unit != RADIAN && angle_unit != GRADE && angle_unit != DEGREE) return;
  if(persistent_settings.grade == (u8) angle_unit) {
    write_persistent_settings();
    return;
  }

  persistent_settings.grade = (u8) angle_unit;
  persistent_settings.counter++;
  persistent_settings_needs_save = true;
  write_persistent_settings();
}

bool erase_slot_old(usize nSlot) {
  if(nSlot > MAX_SLOT_FOR_PROGRAM) return false;
  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) nSlot);
  return !program_store::exists(program_store::ProgramType::MK61, name) ||
         program_store::remove(program_store::ProgramType::MK61, name);
}

bool erase_slot(usize nSlot) {
  return erase_slot_old(nSlot);
}

usize seek_program_END(u8* code_page) {
  const isize program_steps = (isize) core_61::program_steps();
  isize lastCommand = program_steps;
  while (lastCommand > 0 && code_page[lastCommand] == 0) {
    lastCommand--;
  }

  if(lastCommand == 0 && code_page[0] == 0) return 0;
  if(lastCommand < program_steps) lastCommand++;
  if(lastCommand < program_steps) lastCommand++;

  return lastCommand;
}

isize  calc_address(usize nSlot) {
  if(nSlot > MAX_SLOT_FOR_PROGRAM) return -1;

  const int address = nSlot * FLASH_SECTOR_SIZE;

  dbgln(SPIROM, "X-reg as addsress ", address);
  return address;
}

isize  calc_address(void) {
  const isize n_cell = MK61Emu_GetDisplayReg();

  if(n_cell > MAX_SLOT_FOR_PROGRAM) {
    lcd.setCursor(0, 0); lcd.print(library_mk61::text("Error! slot > ", "SLOT > ")); lcd.print(MAX_SLOT_FOR_PROGRAM);
    return -1;
  } else {
    /*lcd.print("slot ");*/ lcd.print(n_cell);
  }

  const int address = n_cell * FLASH_SECTOR_SIZE;

  #ifdef SERIAL_OUTPUT
    Serial.print("X-reg as addsress "); Serial.println(address);
  #endif
  return address;
}

void init_external_flash(void) {
  dbgln(SPIROM, "Init flash -> ");

  // Инициализация SPI
  SPI.begin();
 
  // JEDEC/SFDP discovery; unknown parts fall back to C5's boundary probe.
  flash_is_ok = flash.begin();
  if(flash_is_ok) program_store::init();
  #ifdef DEBUG_SPIFLASH
    if(flash_is_ok) {
      Serial.print("JEDEC ID: 0x"); Serial.println(flash.getJEDECID(), HEX);
      Serial.print("SFDP: "); Serial.println(flash.sfdpPresent() ? "yes" : "no");
      Serial.print("declared upper bound: ");
      Serial.print(flash.capacityProbeUpper()); Serial.println(" bytes");
      if(program_store::ready()) {
        Serial.print("measured C5 capacity: ");
        Serial.print(flash.getCapacity()); Serial.println(" bytes");
      } else {
        Serial.println("C5 capacity detection failed");
      }
    } else {
      Serial.println("ERROR!");
    }
  #endif
}

u8 load_word(isize segment_address, isize offset) {
  (void) segment_address;
  (void) offset;
#if MK61_USE_ARDUINO_EEPROM_FALLBACK
  return EEPROM.read(offset);
#else
  return 0xFF;
#endif
}

bool load_from(isize address) {
  if(address < 0 || address % FLASH_SECTOR_SIZE != 0) return false;
  char name[8];
  snprintf(name, sizeof(name), "%u",
           (unsigned) (address / FLASH_SECTOR_SIZE));
  return m61_text::load_program(name);
}

bool Load(usize nSlot) {
  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) nSlot);
  return LoadProgram(name);
}

